commons/ihe/xds/src/main/resources/wsdl/iti15.wsdl

<?xml version="1.0" encoding="utf-8"?>

<!--
    Copyright 2009 the original author or authors. Licensed under the Apache
    License, Version 2.0 (the "License"); you may not use this file except
    in compliance with the License. You may obtain a copy of the License at
    http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable
    law or agreed to in writing, software distributed under the License is
    distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
    KIND, either express or implied. See the License for the specific
    language governing permissions and limitations under the License.
-->

<definitions
        xmlns="http://schemas.xmlsoap.org/wsdl/"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
        xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:ihe="urn:ihe:iti:xds:2007"
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:rs="urn:oasis:names:tc:ebxml-regrep:registry:xsd:2.1"
        targetNamespace="urn:ihe:iti:xds:2007"
        name="DocumentRepository">

    <documentation>IHE XDS.a Document Repository = ITI-15 adaptor = Provide And Register Document Set</documentation>

    <types>
        <xsd:schema elementFormDefault="qualified">
            <xsd:import namespace="urn:oasis:names:tc:ebxml-regrep:registry:xsd:2.1" schemaLocation="classpath:wsdl/schema/ebRS21/rs.xsd"/>
        </xsd:schema>
    </types>

    <message name="ProvideAndRegisterDocumentSet_Message">
        <documentation>Provide and Register Document Set</documentation>
        <part name="body" element="rs:SubmitObjectsRequest"/>
    </message>

    <message name="ProvideAndRegisterDocumentSetResponse_Message">
        <documentation>Provide And Register Document Set Response</documentation>
        <part name="body" element="rs:RegistryResponse"/>
    </message>

    <portType name="DocumentRepository_PortType">
        <operation name="DocumentRepository_ProvideAndRegisterDocumentSet">
            <input message="ihe:ProvideAndRegisterDocumentSet_Message"/>
<!--                   wsam:Action="urn:ihe:iti:2007:ProvideAndRegisterDocumentSet"/>-->
            <output message="ihe:ProvideAndRegisterDocumentSetResponse_Message"/>
<!--                    wsam:Action="urn:ihe:iti:2007:ProvideAndRegisterDocumentSetResponse"/>-->
        </operation>
    </portType>

    <binding name="DocumentRepository_Binding_Soap11" type="ihe:DocumentRepository_PortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="DocumentRepository_ProvideAndRegisterDocumentSet">
            <soap:operation soapAction="urn:ihe:iti:2007:ProvideAndRegisterDocumentSet"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>

    <service name="DocumentRepository_Service">
        <port name="DocumentRepository_Port_Soap11" binding="ihe:DocumentRepository_Binding_Soap11">
            <soap:address location="http://servicelocation/DocumentRepository_Service"/>
        </port>
    </service>
</definitions>
