server/all/deploy/ebxmlrr-service.sar/META-INF/signedSOAPRequest.xml

<soap-env:Envelope xmlns:SOAP-SEC="http://schemas.xmlsoap.org/soap/security/2000-12" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" soap-env:actor="some-uri" soap-env:mustUnderstand="1">

	<soap-env:Header>
	<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:CanonicalizationMethod>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-sha1"></ds:SignatureMethod>
<ds:Reference URI="#Body">
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>gxEfo2a2V6DGnDwC5vpeqAxzMJw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>ZPn+AnyRse1ly5FfS7aAmV50v/mDlnbkHitK5Lrdv1cS6DAkBRxQIw==</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIC2jCCApcCBECXzQswCwYHKoZIzjgEAwUAMFIxDDAKBgNVBAYTA1VTQTEVMBMGA1UEChMMU291
cmNlIEZvcmdlMRAwDgYDVQQLEwdlYnhtbHJyMRkwFwYDVQQDExBSZWdpc3RyeU9wZXJhdG9yMB4X
DTA0MDUwNDE3MDQxMVoXDTA0MDgwMjE3MDQxMVowUjEMMAoGA1UEBhMDVVNBMRUwEwYDVQQKEwxT
b3VyY2UgRm9yZ2UxEDAOBgNVBAsTB2VieG1scnIxGTAXBgNVBAMTEFJlZ2lzdHJ5T3BlcmF0b3Iw
ggG4MIIBLAYHKoZIzjgEATCCAR8CgYEA/X9TgR11EilS30qcLuzk5/YRt1I870QAwx4/gLZRJmlF
XUAiUftZPY1Y+r/F9bow9subVWzXgTuAHTRv8mZgt2uZUKWkn5/oBHsQIsJPu6nX/rfGG/g7V+fG
qKYVDwT7g/bTxR7DAjVUE1oWkTL2dfOuK2HXKu/yIgMZndFIAccCFQCXYFCPFSMLzLKSuYKi64QL
8Fgc9QKBgQD34aCF1ps93su8q1w2uFe5eZSvu/o66oL5V0wLPQeCZ1FZV4661FlP5nEHEIGAtEkW
cSPoTCgWE7fPCTKMyKbhPBZ6i1R8jSjgo64eK7OmdZFuo38L+iE1YvH7YnoBJDvMpPG+qFGQiaiD
3+Fa5Z8GkotmXoB7VSVkAUw7/s9JKgOBhQACgYEAtuXYj38s89nYkbeXlklloW86X5BJ0cHDQexn
M7Sl4CJ5utfi3s1SOhaGKtQXLESmJlKfarBMXYQHOVASpke2/+rKazfhMo7axI4O3TDBWK42YP2b
DXDfwRyzsvCrFSFmDMQoC4Zb255g6I9L3LMq5FwSCOyBYkMfjAIlDwVDz+QwCwYHKoZIzjgEAwUA
AzAAMC0CFAZ0TORO1JntwO1mYkFktVh5qXYcAhUAg0jVMAbTtccdayMBJVfHVL5yVSA=
</ds:X509Certificate>
</ds:X509Data>
<ds:KeyValue>
<ds:DSAKeyValue>
<ds:P>
/X9TgR11EilS30qcLuzk5/YRt1I870QAwx4/gLZRJmlFXUAiUftZPY1Y+r/F9bow9subVWzXgTuA
HTRv8mZgt2uZUKWkn5/oBHsQIsJPu6nX/rfGG/g7V+fGqKYVDwT7g/bTxR7DAjVUE1oWkTL2dfOu
K2HXKu/yIgMZndFIAcc=
</ds:P>
<ds:Q>l2BQjxUjC8yykrmCouuEC/BYHPU=</ds:Q>
<ds:G>
9+GghdabPd7LvKtcNrhXuXmUr7v6OuqC+VdMCz0HgmdRWVeOutRZT+ZxBxCBgLRJFnEj6EwoFhO3
zwkyjMim4TwWeotUfI0o4KOuHiuzpnWRbqN/C/ohNWLx+2J6ASQ7zKTxvqhRkImog9/hWuWfBpKL
Zl6Ae1UlZAFMO/7PSSo=
</ds:G>
<ds:Y>
tuXYj38s89nYkbeXlklloW86X5BJ0cHDQexnM7Sl4CJ5utfi3s1SOhaGKtQXLESmJlKfarBMXYQH
OVASpke2/+rKazfhMo7axI4O3TDBWK42YP2bDXDfwRyzsvCrFSFmDMQoC4Zb255g6I9L3LMq5FwS
COyBYkMfjAIlDwVDz+Q=
</ds:Y>
</ds:DSAKeyValue>
</ds:KeyValue>
</ds:KeyInfo>
</ds:Signature></soap-env:Header>

	<soap-env:Body SOAP-SEC:id="Body">

<!--$Header: /cvsroot/jboss/contrib/varia/src/resources/jaxr/signedSOAPRequest.xml,v 1.1 2004/09/01 03:25:16 osdchicago Exp $-->
<!--Must be loaded after SubmitObjectsRequest_objectTypesSchemes -->
<rs:SubmitObjectsRequest xmlns="urn:oasis:names:tc:ebxml-regrep:rim:xsd:2.1" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:rim:xsd:2.1" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:registry:xsd:2.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:oasis:names:tc:ebxml-regrep:rim:xsd:2.1 http://www.oasis-open.org/committees/regrep/documents/2.1/schema/rim.xsd urn:oasis:names:tc:ebxml-regrep:registry:xsd:2.1 http://www.oasis-open.org/committees/regrep/documents/2.1/schema/rs.xsd">
	<LeafRegistryObjectList>
		<Organization id="urn:uuid:388678e9-40df-4412-ac65-c42bbb265e7d" primaryContact="urn:uuid:921284f0-bbed-4a4c-9342-ecaf0625f9d7">
			<Name>
				<LocalizedString lang="en-US" value="ebxmlrr test registry"></LocalizedString>
			</Name>
			<Description>
				<LocalizedString lang="en-US" value="ebxmlrr test registry"></LocalizedString>
			</Description>
			<Address city="Burlington" country="USA" postalCode="01867" stateOrProvince="MA" street="Network Dr." streetNumber="1"></Address>
			<TelephoneNumber areaCode="781" countryCode="1" number="442-0703" phoneType="office"></TelephoneNumber>
			<TelephoneNumber areaCode="781" countryCode="1" number="442-0704" phoneType="fax"></TelephoneNumber>
		</Organization>
		<Service id="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613">
			<Name>
				<LocalizedString lang="en-US" value="Default XML Cataloging Service"></LocalizedString>
			</Name>
			<Description>
				<LocalizedString lang="en-US" value="Default XML Cataloging Service"></LocalizedString>
			</Description>
			<!--ContentManagementService classification-->
			<Classification classificationNode="urn:uuid:bfe64895-37d4-4d18-a776-cbb1dcba52a3" classifiedObject="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613">
				<Name>
					<LocalizedString lang="en-US" value="ContentCatalogingService"></LocalizedString>
				</Name>
			</Classification>
			<!--InvocationModel classification-->
			<Classification classificationNode="urn:uuid:1365e3f7-9899-4647-bc0f-ea2ccf5144b7" classifiedObject="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613">
				<Name>
					<LocalizedString lang="en-US" value="Inline"></LocalizedString>
				</Name>
			</Classification>
			<!--ErrorHandlingModel classification-->
			<Classification classificationNode="urn:uuid:112e3809-65b4-41b4-a8c5-e08756385c6d" classifiedObject="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613">
				<Name>
					<LocalizedString lang="en-US" value="FailOnError"></LocalizedString>
				</Name>
			</Classification>
			<ServiceBinding accessURI="" id="urn:uuid:5efdd028-8358-48c9-8fd4-c1cd1edf2dd5">
				<Name>
					<LocalizedString lang="en-US" value="Default XML Cataloging Service binding"></LocalizedString>
				</Name>
				<Description>
					<LocalizedString lang="en-US" value="Service Binding to Default XML Cataloging Service"></LocalizedString>
				</Description>
			</ServiceBinding>
		</Service>
		<Association associationType="ProviderOf" sourceObject="urn:uuid:388678e9-40df-4412-ac65-c42bbb265e7d" targetObject="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613"></Association>
		<!--Assoc between default XML Cataloging Service and xml ClassificationNode in ObjectTypes scheme -->
		<Association associationType="ContentManagementServiceFor" sourceObject="urn:uuid:4bcfc370-7a71-4c50-a6ed-ade41d836613" targetObject="urn:uuid:4a13dacb-a9e8-4819-bd1a-faf50976e5d4"></Association>
		<!--The default ACP for the Registry -->
		<ExtrinsicObject id="urn:uuid:38aff259-d20c-486f-8907-b4c97d99bdc5" objectType="urn:uuid:7c50351e-0022-4a65-950c-ac8cda6f3e0b">
			<Name>
				<LocalizedString value="The default Access Control Policy for the Registry"></LocalizedString>
			</Name>
			<Description>
				<LocalizedString value="Applies to RegistryObjects that do not have a custom Policy"></LocalizedString>
			</Description>
			<!--Add a Slot with value for each composed policy. This will be automated in future via cataloging of PolicySets -->
			<Slot name="ComposedPolicies">
				<ValueList>
					<Value>urn:oasis:names:tc:ebxml-regrep:3.0:rim:acp:policy:policyid:permit-anyone-to-read</Value>
					<Value>urn:oasis:names:tc:ebxml-regrep:3.0:rim:acp:policy:policyid:permit-owner-all</Value>
					<Value>urn:oasis:names:tc:ebxml-regrep:3.0:rim:acp:policy:policyid:permit-registryadministrator-all</Value>
				</ValueList>
			</Slot>
		</ExtrinsicObject>
		<!--User for RegistryOperator -->
		<ObjectRef id="urn:uuid:921284f0-bbed-4a4c-9342-ecaf0625f9d7"></ObjectRef>
		<!--xml ObjectType, Defined in SubmitObjectsRequest_objectTypesSchemes -->
		<ObjectRef id="urn:uuid:4a13dacb-a9e8-4819-bd1a-faf50976e5d4"></ObjectRef>
	</LeafRegistryObjectList>
</rs:SubmitObjectsRequest>

	</soap-env:Body>

</soap-env:Envelope>